db = \
{ \
    'DarkKnight':{
        '武器':('妖精王(暴暴)','450HQ(暴暴暴暴暴)','零式(速速)'), \
        '头部':('普通eden(暴直)','450HQ(暴直直直直)','点数(直直)'), \
        '衣服':('450HQ(暴暴)','450HQ(暴暴直直直)','点数(暴暴)'), \
        '手部':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '腰带':('450HQ(暴)','450HQ(暴直直直直)','点数(直直)'), \
        '裤子':('普通eden(暴暴)','450HQ(直直直直直)','点数(暴暴)'), \
        '鞋子':('普通eden(暴直)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '耳环':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(暴直)'), \
        '项链':('450HQ(直)','450HQ(直直直直直)','点数(直直)'), \
        '手镯':('450HQ(暴)','450HQ(暴直直直直)','零式(直直)'), \
        '戒指左':('全能王(直)','450HQ(暴暴暴暴暴)','零式(暴直)'), \
        '戒指右':('普通eden(直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
    }, \
    'Warrior':{
        '武器':('妖精王(信信)','450HQ(暴暴信信信)','零式(速速)'), \
        '头部':('普通eden(暴信)','450HQ(暴信信信信)','点数(信信)'), \
        '衣服':('450HQ(暴暴)','450HQ(暴暴坚速速)','点数(暴暴)'), \
        '手部':('普通eden(信信)','450HQ(暴暴暴暴暴)','零式(信速)'), \
        '腰带':('450HQ(暴)','450HQ(暴速速速速)','点数(信信)'), \
        '裤子':('普通eden(暴暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '鞋子':('450HQ(暴暴)','450HQ(暴暴暴暴暴)','零式(信信)'), \
        '耳环':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(暴信)'), \
        '项链':('全能王(暴)','450HQ(信速速速速)','点数(信信)'), \
        '手镯':('普通eden(暴)','450HQ(暴信信信信)','零式(速速)'), \
        '戒指左':('全能王(速)','450HQ(暴暴暴暴暴)','零式(暴信)'), \
        '戒指右':('450HQ(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
    }, \
    'Paladin':{
        '武器':('妖精王(直直)','450HQ(暴暴暴暴暴)','零式(暴直)'), \
        '头部':('普通eden(暴直)','450HQ(暴直直直直)','点数(直直)'), \
        '衣服':('450HQ(暴暴)','450HQ(暴暴直直直)','零式(暴暴)'), \
        '手部':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '腰带':('450HQ(暴)','450HQ(暴直直直直)','点数(直直)'), \
        '裤子':('普通eden(暴暴)','450HQ(直直直直直)','点数(暴暴)'), \
        '鞋子':('450HQ(暴暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '耳环':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(暴直)'), \
        '项链':('全能王(暴)','450HQ(直直直直直)','点数(直直)'), \
        '手镯':('普通eden(暴)','450HQ(暴直直直直)','零式(直直)'), \
        '戒指左':('全能王(速)','450HQ(暴暴暴暴暴)','零式(暴直)'), \
        '戒指右':('450HQ(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
    }, \
    'Gunbreaker':{ \
        '武器':('妖精王(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '头部':('普通eden(暴直)','450HQ(暴直直直直)','点数(直直)'), \
        '衣服':('450HQ(暴暴)','450HQ(暴暴直直直)','零式(暴暴)'), \
        '手部':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '腰带':('450HQ(暴)','450HQ(暴直直直直)','点数(直直)'), \
        '裤子':('普通eden(暴暴)','450HQ(直直直直直)','点数(暴暴)'), \
        '鞋子':('450HQ(暴暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '耳环':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(暴直)'), \
        '项链':('全能王(暴)','450HQ(直直直直直)','点数(直直)'), \
        '手镯':('普通eden(暴)','450HQ(暴直直直直)','零式(直直)'), \
        '戒指左':('全能王(速)','450HQ(暴暴暴暴暴)','零式(暴直)'), \
        '戒指右':('450HQ(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
    }, \
    'WhiteMage':{ \
        '武器':('妖精王(速速)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '头部':('450HQ(暴直)','450HQ(暴直直直直)','零式(暴暴)'), \
        '衣服':('450HQ(速速)','450HQ(速速速速速)','点数(暴暴)'), \
        '手部':('普通eden(速直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '腰带':('普通eden(暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '裤子':('普通eden(速速)','450HQ(暴暴速速速)','零式(直直)'), \
        '鞋子':('普通eden(速直)','450HQ(暴速速速速)','零式(暴速)'), \
        '耳环':('450HQ(暴)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '项链':('普通eden(暴)','450HQ(速速速速速)','零式(暴暴)'), \
        '手镯':('全能王(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '戒指左':('450HQ(暴)','450HQ(暴速速速速)','点数(直直)'), \
        '戒指右':('450HQ(暴)','450HQ(暴速速速速)','零式(暴暴)'), \
    }, \
    'Scholar':{ \
        '武器':('妖精王(直直)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '头部':('450HQ(暴直)','450HQ(暴直直直直)','零式(暴暴)'), \
        '衣服':('450HQ(直直)','450HQ(直直直直直)','点数(暴暴)'), \
        '手部':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '腰带':('普通eden(暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '裤子':('普通eden(直直)','450HQ(暴暴直直直)','零式(直直)'), \
        '鞋子':('普通eden(直直)','450HQ(暴直直直直)','零式(暴直)'), \
        '耳环':('450HQ(暴)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '项链':('普通eden(暴)','450HQ(直直直直直)','点数(暴直)'), \
        '手镯':('全能王(暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '戒指左':('450HQ(暴)','450HQ(暴直直直直)','点数(直直)'), \
        '戒指右':('450HQ(暴)','450HQ(暴直直直直)','460点数(直直)'), \
    }, \
    'Astrologian':{ \
        '武器':('450HQ(暴暴)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '头部':('450HQ(暴直)','450HQ(暴直直直直)','零式(暴暴)'), \
        '衣服':('450HQ(直直)','450HQ(直直直直直)','点数(暴暴)'), \
        '手部':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '腰带':('普通eden(暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '裤子':('普通eden(直直)','450HQ(暴暴直直直)','零式(直直)'), \
        '鞋子':('普通eden(直直)','450HQ(暴直直直直)','零式(暴直)'), \
        '耳环':('450HQ(暴)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '项链':('普通eden(暴)','450HQ(直直直直直)','点数(暴直)'), \
        '手镯':('全能王(暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '戒指左':('450HQ(暴)','450HQ(暴直直直直)','点数(直直)'), \
        '戒指右':('450HQ(暴)','450HQ(暴直直直直)','460点数(直直)'), \
    }, \
    'Summoner':{ \
        '武器':('妖精王(暴暴)','450HQ(直直直直直)','零式(直直)'), \
        '头部':('普通eden(暴暴)','450HQ(直直直直直)','零式(直直)'), \
        '衣服':('450HQ(暴暴)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '手部':('普通eden(直信)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '腰带':('普通eden(直)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '裤子':('450HQ(直直)','450HQ(直直信信信)','零式(暴暴)'), \
        '鞋子':('普通eden(暴暴)','450HQ(暴直直直直)','点数(暴信)'), \
        '耳环':('全能王(直)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '项链':('450HQ(直)','450HQ(直信信信信)','点数(直信)'), \
        '手镯':('全能王(暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '戒指左':('450HQ(暴)','450HQ(暴信信信信)','点数(直信)'), \
        '戒指右':('450HQ(暴)','450HQ(暴信信信信)','零式(暴暴)'), \
    }, \
    'RedMage':{ \
        '武器':('妖精王(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '头部':('普通eden(暴暴)','450HQ(直直直直直)','零式(直直)'), \
        '衣服':('450HQ(暴暴)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '手部':('普通eden(直信)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '腰带':('普通eden(直)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '裤子':('450HQ(直直)','450HQ(直直信信信)','零式(暴暴)'), \
        '鞋子':('普通eden(暴暴)','450HQ(暴直直直直)','点数(暴信)'), \
        '耳环':('全能王(直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '项链':('450HQ(直)','450HQ(直信信信信)','点数(直信)'), \
        '手镯':('全能王(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '戒指左':('450HQ(暴)','450HQ(暴信信信信)','点数(直信)'), \
        '戒指右':('450HQ(暴)','450HQ(暴信信信信)','零式(暴暴)'), \
    }, \
    'BlackMage':{ \
        '武器':('妖精王(速速)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '头部':('450HQ(速直)','450HQ(速直直直直)','零式(直速)'), \
        '衣服':('普通eden(速速)','450HQ(速速速速速)','零式(速速)'), \
        '手部':('450HQ(暴暴)','450HQ(暴暴暴暴暴)','点数(直暴)'), \
        '腰带':('450HQ(暴暴)','450HQ(暴暴速速速)','点数(速速)'), \
        '裤子':('450HQ(速速)','450HQ(速速速速速)','点数(直直)'), \
        '鞋子':('450HQ(暴直)','450HQ(暴直直直直)','零式(直直)'), \
        '耳环':('普通eden(暴)','450HQ(速速速速速)','点数(速直)'), \
        '项链':('全能王(暴)','450HQ(速速速速速)','零式(直直)'), \
        '手镯':('450HQ(暴)','450HQ(暴暴速速速)','零式(直速)'), \
        '戒指左':('450HQ(暴)','450HQ(速速速速速)','点数(速速)'), \
        '戒指右':('450HQ(暴)','450HQ(速速速速速)','零式(速速)'), \
    }, \
    'Bard':{ \
        '武器':('妖精王(直直)','450HQ(暴暴直直直)','零式(暴暴)'), \
        '头部':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '衣服':('450HQ(直直)','450HQ(直直信信信)','零式(直直)'), \
        '手部':('普通eden(直信)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '腰带':('450HQ(直)','450HQ(直信信信信)','点数(直信)'), \
        '裤子':('普通eden(直直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '鞋子':('普通eden(暴暴)','450HQ(直直直直直)','零式(暴直)'), \
        '耳环':('普通eden(直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '项链':('全能王(直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '手镯':('450HQ(暴)','450HQ(暴信信信信)','零式(暴暴)'), \
        '戒指左':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '戒指右':('全能王(暴)','450HQ(暴暴暴暴暴)','零式(暴直)'), \
    }, \
    'Machinist':{ \
        '武器':('妖精王(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '头部':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '衣服':('450HQ(直直)','450HQ(直直信信信)','零式(直直)'), \
        '手部':('普通eden(直信)','450HQ(暴暴暴暴暴)','零式(暴信)'), \
        '腰带':('450HQ(直)','450HQ(直信信信信)','点数(直信)'), \
        '裤子':('普通eden(直直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '鞋子':('普通eden(暴暴)','450HQ(直直直直直)','零式(暴直)'), \
        '耳环':('普通eden(直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '项链':('全能王(直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '手镯':('450HQ(暴)','450HQ(暴信信信信)','零式(暴暴)'), \
        '戒指左':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '戒指右':('全能王(暴)','450HQ(暴暴暴暴暴)','零式(暴直)'), \
    }, \
    'Dancer':{ \
        '武器':('妖精王(直直)','450HQ(直直直直直)','零式(暴暴)'), \
        '头部':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '衣服':('450HQ(直直)','450HQ(直直信信信)','零式(直直)'), \
        '手部':('普通eden(直信)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '腰带':('450HQ(直)','450HQ(直信信信信)','点数(直信)'), \
        '裤子':('普通eden(直直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '鞋子':('普通eden(暴暴)','450HQ(直直直直直)','零式(暴直)'), \
        '耳环':('普通eden(直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '项链':('全能王(直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '手镯':('450HQ(暴)','450HQ(暴信信信信)','零式(暴暴)'), \
        '戒指左':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '戒指右':('全能王(暴)','450HQ(暴暴暴暴暴)','零式(暴直)'), \
    }, \
    'Dragoon':{ \
        '武器':('妖精王(暴暴)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '头部':('450HQ(直直)','450HQ(直直直直直)','点数(直直)'), \
        '衣服':('450HQ(暴暴)','450HQ(暴暴信信信)','零式(直直)'), \
        '手部':('普通eden(直信)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '腰带':('450HQ(暴)','450HQ(暴暴暴暴暴)','零式(直直)'), \
        '裤子':('450HQ(直直)','450HQ(直直信信信)','零式(暴暴)'), \
        '鞋子':('450HQ(直直)','450HQ(暴暴暴暴暴)','点数(直速)'), \
        '耳环':('450HQ(直)','450HQ(直直直直直)','点数(直速)'), \
        '项链':('全能王(暴)','450HQ(直直直直直)','零式(直速)'), \
        '手镯':('普通eden(直)','450HQ(暴直直直直)','点数(直速)'), \
        '戒指左':('450HQ(直)','450HQ(直信信信信)','零式(直直)'), \
        '戒指右':('450HQ(直)','450HQ(直信信信信)','点数(暴速)'), \
    }, \
    'Monk':{ \
        '武器':('妖精王(直直)','450HQ(直直信信信)','零式(直直)'), \
        '头部':('普通eden(暴暴)','450HQ(暴暴暴暴暴)','点数(直速)'), \
        '衣服':('普通eden(暴暴)','450HQ(直直信信信)','零式(暴暴)'), \
        '手部':('450HQ(暴直)','450HQ(暴暴直直直)','零式(直直)'), \
        '腰带':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '裤子':('普通eden(直直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '鞋子':('450HQ(暴直)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '耳环':('普通eden(直)','450HQ(直直直直直)','点数(直直)'), \
        '项链':('450HQ(直)','450HQ(直直直直直)','零式(直速)'), \
        '手镯':('普通eden(直)','450HQ(暴直直直直)','点数(直直)'), \
        '戒指左':('全能王(暴)','450HQ(直信信信信)','零式(直直)'), \
        '戒指右':('450HQ(直)','450HQ(直信信信信)','点数(暴信)'), \
    }, \
    'Ninja':{ \
        '武器':('妖精王(暴暴)','450HQ(直直信信信)','零式(暴暴)'), \
        '头部':('450HQ(直直)','450HQ(直直直直直)','点数(暴信)'), \
        '衣服':('450HQ(暴暴)','450HQ(暴暴信信信)','点数(暴暴)'), \
        '手部':('普通eden(暴信)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '腰带':('450HQ(直)','450HQ(直信信信信)','点数(暴暴)'), \
        '裤子':('450HQ(直直)','450HQ(直直直直直)','零式(直直)'), \
        '鞋子':('普通eden(暴直)','450HQ(暴暴暴暴暴)','零式(暴直)'), \
        '耳环':('普通eden(直)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '项链':('全能王(直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '手镯':('450HQ(暴)','450HQ(暴信信信信)','零式(暴暴)'), \
        '戒指左':('普通eden(暴)','450HQ(暴暴暴暴暴)','零式(暴信)'), \
        '戒指右':('全能王(暴)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
    }, \
    'Samurai':{ \
        '武器':('450HQ(暴暴)','450HQ(暴暴暴暴暴)','零式(暴暴)'), \
        '头部':('普通eden(暴暴)','450HQ(暴暴暴暴暴)','点数(直信)'), \
        '衣服':('普通eden(暴暴)','450HQ(直直信信信)','零式(直直)'), \
        '手部':('450HQ(暴直)','450HQ(暴暴直直直)','零式(直直)'), \
        '腰带':('普通eden(暴)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '裤子':('普通eden(直直)','450HQ(暴暴暴暴暴)','点数(暴暴)'), \
        '鞋子':('450HQ(暴直)','450HQ(暴暴暴暴暴)','点数(直直)'), \
        '耳环':('普通eden(直)','450HQ(直直直直直)','点数(直直)'), \
        '项链':('450HQ(直)','450HQ(直直直直直)','零式(直速)'), \
        '手镯':('全能王(暴)','450HQ(暴直直直直)','点数(直直)'), \
        '戒指左':('普通eden(直)','450HQ(直信信信信)','零式(直直)'), \
        '戒指右':('450HQ(暴)','450HQ(直信信信信)','点数(暴信)'), \
    }, \
    '禁断方案':'左边88877饰品及腰带88777'
}

def equip_advise_5_05(job):
    data = ''
    data += '450开荒建议:\n\t'
    for part in db[job].keys():
        data += part + ':'
        data += db[job][part][0] + '\n\t'
    data = data[:-1]
    data += '450HQ禁断建议:\n\t'
    for part in db[job].keys():
        data += part + ':'
        data += db[job][part][1] + '\n\t'
    data += '禁断方案:\n\t' + db['禁断方案'] + '\n'
    data += '470毕业建议:\n\t'
    for part in db[job].keys():
        data += part + ':'
        data += db[job][part][2] + '\n\t'
    data = data[:-1]
    data += '更多更全配装请访问https://pan.baidu.com/s/1X8mAkjgvL7FUHRU9PIUk9Q 提取码h16d'
    return data
        
def equip_advise_url_5_05():
    return 'https://pan.baidu.com/s/1X8mAkjgvL7FUHRU9PIUk9Q 提取码h16d'

